In [1]:
import pandas as pd

In [37]:
df= pd.read_csv("Datos.csv", index_col= "id")

In [38]:
df

            name last_name   startDate      work  id.1        name.1
id
1   Jose Alberto  Escalona   8-04-2021  Chedraui     1  Jose Alberto
2          Nadia   Buendia  03-04-2021   Walmart     2         Nadia
3     Pablo Saul   Ramirez  01-04-2020     GoNet     3    Pablo Saul
4       Santiago     Perea  02-12-2021    Devlyn     4      Santiago
5         Brenda  Samperio  03-04-2021   Walmart     5        Brenda

In [43]:
for id in df:
    print (id)

name
last_name
startDate
work
id.1
name.1

In [40]:
Jdf= df.to_json()

In [41]:
Jdf

'{"name":{"1":"Jose Alberto","2":"Nadia","3":"Pablo Saul","4":"Santiago","5":"Brenda"},"last_name":{"1":"Escalona","2":"Buendia","3":"Ramirez","4":"Perea","5":"Samperio"},"startDate":{"1":"8-04-2021","2":"03-04-2021","3":"01-04-2020","4":"02-12-2021","5":"03-04-2021"},"work":{"1":"Chedraui","2":"Walmart","3":"GoNet","4":"Devlyn","5":"Walmart"},"id.1":{"1":1,"2":2,"3":3,"4":4,"5":5},"name.1":{"1":"Jose Alberto","2":"Nadia","3":"Pablo Saul","4":"Santiago","5":"Brenda"}}'